Revit 2026 API

# CustomFieldData Class

---

A class that offer access to the information about a custom field.

SystemObject Autodesk.Revit.DBCustomFieldData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CustomFieldData : IDisposable
```
```vb
Public Class CustomFieldData
	Implements IDisposable
```
```cpp
public ref class CustomFieldData : IDisposable
```
```fsharp
type CustomFieldData =
    class
        interface IDisposable
    end
```

The CustomFieldData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultRowHeightOnSheet | Identifies the default row height for this field. |
|  | FieldName | The name of this custom field. |
|  | FieldTooltip | The tooltip that will be shown in the schedule properties dialog for this custom field. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CustomFieldData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCustomFieldId | Gets an unique identifier of the custom field. |
|  | GetCustomFieldProperties | Gets an instance of ICustomFieldProperties which represents the properties of this field. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetCustomFieldProperties | Sets an instance of ICustomFieldProperties which represents the properties of this field. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | ValidateCustomFieldProperties | Validates the custom field properties. |

#### Reference

Autodesk.Revit.DB Namespace